"""
1. გაუცვალეთ ორ ცვლადს მნიშვნელობები
"""
a = 1
b = 2

"""
2. შეატრიალეთ ლისტი
"""
lst = [1, 2, 3, 4, 5, 6]

"""
3. შეამოწმეთ არის თუ არა რიცხვი პალინდრომი
"""
number = 798

"""
4. მოცემულია n და k დაწერეთ ფუნცია რომელიც დააბრუნებს k-ს პირველ n ხარისხს
"""


def generate_powers(n, k):
    pass


"""
5. მოცემულია ლისტი და ელემენტი დაწერეთ ფუნქცია რომელიც დააბრუნებს ლისტში რომელ ინდექსებზე გვხვდება ეს ელემენტი
"""


def elem_indexes(lst, elem):
    pass


"""
6. დაწერეთ ქუიქ სორტის ალგორითმი
"""


def quicksort(sequence):
    pass
