"""
1.
დაწერეთ map-ის იმპლემენტაცია და მისი გამოყენებით დაწერეთ ორი ამოცანა
1. გადმოგეცემათ რიცხვების ლისტი და ამ ლისტებისთვის დააბრუნეთ სია სადაც ეწერება True თუ რიცხვი ლუწია და False თუ კენტია
2. გადმოგეცემათ რიცხვების ლისტი და ამ ლისტებისთვის დააბრუნეთ სია სადაც ეწერება False თუ რიცხვი ლუწია და True თუ კენტია
"""


"""
2.
შიდა ფუნქციები.
რას დაბეჭდავს parent() ფუნქცია
"""
# def parent():
#     print("Printing from the parent() function")

#     def first_child():
#         print("Printing from the first_child() function")

#     def second_child():
#         print("Printing from the second_child() function")

#     first_child()
#     second_child()

# parent()


"""
3.
დაწერეთ ფუნქცია რომელიც დააბრუნებს ფუნქციას რომელიც ამოწმებს რიცხვის ლუწობას თუ გადავცემთ პარამეტრად "EVEN"-ს და
დააბრუნებს ფუნქციას რომელიც ამოწმებს რიცხვის კენტობას თუ გადავცემთ პარამეტრად "ODD"-ს
"""

"""
4.
დაწერეთ მარტივი დეკორატორი რომელიც ფუნქციის დაწყებისას დაბეჭდავს დაწყების დროს და დასრულებისასაც დაბეჭდავს დასრულების დროს და რამდენ ხანში დასრულდა
"""

"""
5.
დაწერეთ დეკორატორი რომელიც ორჯერ გამოიძახებს ფუნქციას
"""

"""
6.
დაწერეთ ფუნქცია რომელსაც გადაეცემა n და აბრუნებს ფიბონაჩის მიმდევრობის n-ურ წევრს
"""


"""
7.
დაწერეთ გენერატორი რომელიც აბრუნებს ფიბონაჩის მიმდევრობის წევრებს
"""
